UrlClickEvents 
| extend UrlBlocked = ActionType has_any("ClickBlocked")
| extend UrlAllowed = ActionType has_any("ClickAllowed")
| extend UrlPendingVerdict = ActionType has_any("UrlScanInProgress")
| extend ErrorPage = ActionType has_any("UrlErrorPage")
| summarize Blocked = sum(UrlBlocked), Allowed = sum(UrlAllowed), PendingVerdict = sum(UrlPendingVerdict), Error = sum(ErrorPage), ClickedThrough = sum(IsClickedThrough) by bin(TimeGenerated, 1d)
